fixture/vcr_cassettes/charge_test/capture.json

[
  {
    "request": {
      "body": "amount=1000&currency=JPY&capture=false&card[number]=4242424242424242&card[exp_month]=2&card[exp_year]=2020&card[country]=JP&card[name]=Ducky+Test&card[cvc]=123&description=1000+Widgets",
      "headers": {
        "Authorization": "Basic non_empty_secret_key_string",
        "Content-Type": "application/x-www-form-urlencoded",
        "User-Agent": "Payjp/v1 payjp/0.1.0"
      },
      "method": "post",
      "options": [],
      "request_body": "",
      "url": "https://api.pay.jp/v1/charges"
    },
    "response": {
      "body": "{\n  \"amount\": 1000,\n  \"amount_refunded\": 0,\n  \"captured\": false,\n  \"captured_at\": null,\n  \"card\": {\n    \"address_city\": null,\n    \"address_line1\": null,\n    \"address_line2\": null,\n    \"address_state\": null,\n    \"address_zip\": null,\n    \"address_zip_check\": \"unchecked\",\n    \"brand\": \"Visa\",\n    \"country\": \"JP\",\n    \"created\": 1487478525,\n    \"customer\": null,\n    \"cvc_check\": \"passed\",\n    \"exp_month\": 2,\n    \"exp_year\": 2020,\n    \"fingerprint\": \"e1d8225886e3a7211127df751c86787f\",\n    \"id\": \"car_93a0f9f8ad346f20223885494245\",\n    \"last4\": \"4242\",\n    \"livemode\": false,\n    \"metadata\": {},\n    \"name\": \"Ducky Test\",\n    \"object\": \"card\"\n  },\n  \"created\": 1487478525,\n  \"currency\": \"jpy\",\n  \"customer\": null,\n  \"description\": \"1000 Widgets\",\n  \"expired_at\": 1488083325,\n  \"failure_code\": null,\n  \"failure_message\": null,\n  \"id\": \"ch_dc8d3eef5d2e21d307c26fedb5aeb\",\n  \"livemode\": false,\n  \"metadata\": {},\n  \"object\": \"charge\",\n  \"paid\": true,\n  \"refund_reason\": null,\n  \"refunded\": false,\n  \"subscription\": null\n}",
      "headers": {
        "Date": "Sun, 19 Feb 2017 04:28:46 GMT",
        "Content-Type": "application/json",
        "Content-Length": "1016",
        "Connection": "keep-alive",
        "Server": "nginx"
      },
      "status_code": 200,
      "type": "ok"
    }
  },
  {
    "request": {
      "body": "",
      "headers": {
        "Authorization": "Basic non_empty_secret_key_string",
        "Content-Type": "application/x-www-form-urlencoded",
        "User-Agent": "Payjp/v1 payjp/0.1.0"
      },
      "method": "post",
      "options": [],
      "request_body": "",
      "url": "https://api.pay.jp/v1/charges/ch_dc8d3eef5d2e21d307c26fedb5aeb/capture"
    },
    "response": {
      "body": "{\n  \"amount\": 1000,\n  \"amount_refunded\": 0,\n  \"captured\": true,\n  \"captured_at\": 1487478526,\n  \"card\": {\n    \"address_city\": null,\n    \"address_line1\": null,\n    \"address_line2\": null,\n    \"address_state\": null,\n    \"address_zip\": null,\n    \"address_zip_check\": \"unchecked\",\n    \"brand\": \"Visa\",\n    \"country\": \"JP\",\n    \"created\": 1487478525,\n    \"customer\": null,\n    \"cvc_check\": \"passed\",\n    \"exp_month\": 2,\n    \"exp_year\": 2020,\n    \"fingerprint\": \"e1d8225886e3a7211127df751c86787f\",\n    \"id\": \"car_93a0f9f8ad346f20223885494245\",\n    \"last4\": \"4242\",\n    \"livemode\": false,\n    \"metadata\": {},\n    \"name\": \"Ducky Test\",\n    \"object\": \"card\"\n  },\n  \"created\": 1487478525,\n  \"currency\": \"jpy\",\n  \"customer\": null,\n  \"description\": \"1000 Widgets\",\n  \"expired_at\": 1488083325,\n  \"failure_code\": null,\n  \"failure_message\": null,\n  \"id\": \"ch_dc8d3eef5d2e21d307c26fedb5aeb\",\n  \"livemode\": false,\n  \"metadata\": {},\n  \"object\": \"charge\",\n  \"paid\": true,\n  \"refund_reason\": null,\n  \"refunded\": false,\n  \"subscription\": null\n}",
      "headers": {
        "Date": "Sun, 19 Feb 2017 04:28:46 GMT",
        "Content-Type": "application/json",
        "Content-Length": "1021",
        "Connection": "keep-alive",
        "Server": "nginx"
      },
      "status_code": 200,
      "type": "ok"
    }
  }
]