fixture/vcr_cassettes/charge_test/create_with_key.json

[
  {
    "request": {
      "body": "amount=1000&currency=JPY&card[number]=4242424242424242&card[exp_month]=2&card[exp_year]=2020&card[country]=JP&card[name]=Ducky+Test&card[cvc]=123&description=1000+Widgets",
      "headers": {
        "Authorization": "Basic non_empty_secret_key_string",
        "Content-Type": "application/x-www-form-urlencoded",
        "User-Agent": "Payjp/v1 payjp/0.1.0"
      },
      "method": "post",
      "options": [],
      "request_body": "",
      "url": "https://api.pay.jp/v1/charges"
    },
    "response": {
      "body": "{\n  \"amount\": 1000,\n  \"amount_refunded\": 0,\n  \"captured\": true,\n  \"captured_at\": 1487478523,\n  \"card\": {\n    \"address_city\": null,\n    \"address_line1\": null,\n    \"address_line2\": null,\n    \"address_state\": null,\n    \"address_zip\": null,\n    \"address_zip_check\": \"unchecked\",\n    \"brand\": \"Visa\",\n    \"country\": \"JP\",\n    \"created\": 1487478523,\n    \"customer\": null,\n    \"cvc_check\": \"passed\",\n    \"exp_month\": 2,\n    \"exp_year\": 2020,\n    \"fingerprint\": \"e1d8225886e3a7211127df751c86787f\",\n    \"id\": \"car_eb3304048b75a39eb767071213e0\",\n    \"last4\": \"4242\",\n    \"livemode\": false,\n    \"metadata\": {},\n    \"name\": \"Ducky Test\",\n    \"object\": \"card\"\n  },\n  \"created\": 1487478523,\n  \"currency\": \"jpy\",\n  \"customer\": null,\n  \"description\": \"1000 Widgets\",\n  \"expired_at\": null,\n  \"failure_code\": null,\n  \"failure_message\": null,\n  \"id\": \"ch_2e3eb5ba5688612c54bbde3e395de\",\n  \"livemode\": false,\n  \"metadata\": {},\n  \"object\": \"charge\",\n  \"paid\": true,\n  \"refund_reason\": null,\n  \"refunded\": false,\n  \"subscription\": null\n}",
      "headers": {
        "Date": "Sun, 19 Feb 2017 04:28:44 GMT",
        "Content-Type": "application/json",
        "Content-Length": "1015",
        "Connection": "keep-alive",
        "Server": "nginx"
      },
      "status_code": 200,
      "type": "ok"
    }
  }
]