fixture/vcr_cassettes/charge_test/get_with_key.json

[
  {
    "request": {
      "body": "limit=1",
      "headers": {
        "Authorization": "Basic non_empty_secret_key_string",
        "Content-Type": "application/x-www-form-urlencoded",
        "User-Agent": "Payjp/v1 payjp/0.1.0"
      },
      "method": "get",
      "options": [],
      "request_body": "",
      "url": "https://api.pay.jp/v1/charges"
    },
    "response": {
      "body": "{\n  \"count\": 10,\n  \"data\": [\n    {\n      \"amount\": 1000,\n      \"amount_refunded\": 0,\n      \"captured\": true,\n      \"captured_at\": 1487478524,\n      \"card\": {\n        \"address_city\": null,\n        \"address_line1\": null,\n        \"address_line2\": null,\n        \"address_state\": null,\n        \"address_zip\": null,\n        \"address_zip_check\": \"unchecked\",\n        \"brand\": \"Visa\",\n        \"country\": null,\n        \"created\": 1487478522,\n        \"customer\": \"cus_b8bc48c00797c9b549155dfafa20\",\n        \"cvc_check\": \"passed\",\n        \"exp_month\": 1,\n        \"exp_year\": 2018,\n        \"fingerprint\": \"e1d8225886e3a7211127df751c86787f\",\n        \"id\": \"car_622cdc08de0c4c3a7aa38ef4456e\",\n        \"last4\": \"4242\",\n        \"livemode\": false,\n        \"metadata\": {},\n        \"name\": \"Joe Test User\",\n        \"object\": \"card\"\n      },\n      \"created\": 1487478524,\n      \"currency\": \"jpy\",\n      \"customer\": \"cus_b8bc48c00797c9b549155dfafa20\",\n      \"description\": null,\n      \"expired_at\": null,\n      \"failure_code\": null,\n      \"failure_message\": null,\n      \"id\": \"ch_4359a2c004b2e74e51577a8e35440\",\n      \"livemode\": false,\n      \"metadata\": {},\n      \"object\": \"charge\",\n      \"paid\": true,\n      \"refund_reason\": null,\n      \"refunded\": false,\n      \"subscription\": null\n    },\n    {\n      \"amount\": 1000,\n      \"amount_refunded\": 0,\n      \"captured\": true,\n      \"captured_at\": 1487478523,\n      \"card\": {\n        \"address_city\": null,\n        \"address_line1\": null,\n        \"address_line2\": null,\n        \"address_state\": null,\n        \"address_zip\": null,\n        \"address_zip_check\": \"unchecked\",\n        \"brand\": \"Visa\",\n        \"country\": \"JP\",\n        \"created\": 1487478523,\n        \"customer\": null,\n        \"cvc_check\": \"passed\",\n        \"exp_month\": 2,\n        \"exp_year\": 2020,\n        \"fingerprint\": \"e1d8225886e3a7211127df751c86787f\",\n        \"id\": \"car_eb3304048b75a39eb767071213e0\",\n        \"last4\": \"4242\",\n        \"livemode\": false,\n        \"metadata\": {},\n        \"name\": \"Ducky Test\",\n        \"object\": \"card\"\n      },\n      \"created\": 1487478523,\n      \"currency\": \"jpy\",\n      \"customer\": null,\n      \"description\": \"1000 Widgets\",\n      \"expired_at\": null,\n      \"failure_code\": null,\n      \"failure_message\": null,\n      \"id\": \"ch_2e3eb5ba5688612c54bbde3e395de\",\n      \"livemode\": false,\n      \"metadata\": {},\n      \"object\": \"charge\",\n      \"paid\": true,\n      \"refund_reason\": null,\n      \"refunded\": false,\n      \"subscription\": null\n    },\n    {\n      \"amount\": 1000,\n      \"amount_refunded\": 0,\n      \"captured\": true,\n      \"captured_at\": 1487478523,\n      \"card\": {\n        \"address_city\": null,\n        \"address_line1\": null,\n        \"address_line2\": null,\n        \"address_state\": null,\n        \"address_zip\": null,\n        \"address_zip_check\": \"unchecked\",\n        \"brand\": \"Visa\",\n        \"country\": \"JP\",\n        \"created\": 1487478523,\n        \"customer\": null,\n        \"cvc_check\": \"passed\",\n        \"exp_month\": 2,\n        \"exp_year\": 2020,\n        \"fingerprint\": \"e1d8225886e3a7211127df751c86787f\",\n        \"id\": \"car_895910c46fc996bc6c2a399a115e\",\n        \"last4\": \"4242\",\n        \"livemode\": false,\n        \"metadata\": {},\n        \"name\": \"Ducky Test\",\n        \"object\": \"card\"\n      },\n      \"created\": 1487478523,\n      \"currency\": \"jpy\",\n      \"customer\": null,\n      \"description\": \"1000 Widgets\",\n      \"expired_at\": null,\n      \"failure_code\": null,\n      \"failure_message\": null,\n      \"id\": \"ch_30507fbc70e0e184acfefea6b1409\",\n      \"livemode\": false,\n      \"metadata\": {},\n      \"object\": \"charge\",\n      \"paid\": true,\n      \"refund_reason\": null,\n      \"refunded\": false,\n      \"subscription\": null\n    },\n    {\n      \"amount\": 100,\n      \"amount_refunded\": 0,\n      \"captured\": true,\n      \"captured_at\": 1487461247,\n      \"card\": {\n        \"address_city\": null,\n        \"address_line1\": null,\n        \"address_line2\": null,\n        \"address_state\": null,\n        \"address_zip\": null,\n        \"address_zip_check\": \"unchecked\",\n        \"brand\": \"Visa\",\n        \"country\": null,\n        \"created\": 1487461240,\n        \"customer\": null,\n        \"cvc_check\": \"passed\",\n        \"exp_month\": 1,\n        \"exp_year\": 2018,\n        \"fingerprint\": \"e1d8225886e3a7211127df751c86787f\",\n        \"id\": \"car_4e064abb0e027db6abbc73e2d487\",\n        \"last4\": \"4242\",\n        \"livemode\": false,\n        \"metadata\": {},\n        \"name\": \"Joe Test User\",\n        \"object\": \"card\"\n      },\n      \"created\": 1487461247,\n      \"currency\": \"jpy\",\n      \"customer\": \"cus_7b74b10619d73859a093e5e60458\",\n      \"description\": null,\n      \"expired_at\": null,\n      \"failure_code\": null,\n      \"failure_message\": null,\n      \"id\": \"ch_f751333660f93e6c337a4ae71f86a\",\n      \"livemode\": false,\n      \"metadata\": null,\n      \"object\": \"charge\",\n      \"paid\": true,\n      \"refund_reason\": null,\n      \"refunded\": false,\n      \"subscription\": \"sub_f1efc4ff15e199803edbdf653d0b\"\n    },\n    {\n      \"amount\": 100,\n      \"amount_refunded\": 0,\n      \"captured\": true,\n      \"captured_at\": 1487461245,\n      \"card\": {\n        \"address_city\": null,\n        \"address_line1\": null,\n        \"address_line2\": null,\n        \"address_state\": null,\n        \"address_zip\": null,\n        \"address_zip_check\": \"unchecked\",\n        \"brand\": \"Visa\",\n        \"country\": null,\n        \"created\": 1487461240,\n        \"customer\": null,\n        \"cvc_check\": \"passed\",\n        \"exp_month\": 1,\n        \"exp_year\": 2018,\n        \"fingerprint\": \"e1d8225886e3a7211127df751c86787f\",\n        \"id\": \"car_4e064abb0e027db6abbc73e2d487\",\n        \"last4\": \"4242\",\n        \"livemode\": false,\n        \"metadata\": {},\n        \"name\": \"Joe Test User\",\n        \"object\": \"card\"\n      },\n      \"created\": 1487461245,\n      \"currency\": \"jpy\",\n      \"customer\": \"cus_7b74b10619d73859a093e5e60458\",\n      \"description\": null,\n      \"expired_at\": null,\n      \"failure_code\": null,\n      \"failure_message\": null,\n      \"id\": \"ch_ca08e9bf5b098a63dbffa43d025fa\",\n      \"livemode\": false,\n      \"metadata\": null,\n      \"object\": \"charge\",\n      \"paid\": true,\n      \"refund_reason\": null,\n      \"refunded\": false,\n      \"subscription\": \"sub_c28668f4532136bfeec6a286d831\"\n    },\n    {\n      \"amount\": 100,\n      \"amount_refunded\": 0,\n      \"captured\": true,\n      \"captured_at\": 1487461244,\n      \"card\": {\n        \"address_city\": null,\n        \"address_line1\": null,\n        \"address_line2\": null,\n        \"address_state\": null,\n        \"address_zip\": null,\n        \"address_zip_check\": \"unchecked\",\n        \"brand\": \"Visa\",\n        \"country\": null,\n        \"created\": 1487461240,\n        \"customer\": null,\n        \"cvc_check\": \"passed\",\n        \"exp_month\": 1,\n        \"exp_year\": 2018,\n        \"fingerprint\": \"e1d8225886e3a7211127df751c86787f\",\n        \"id\": \"car_4e064abb0e027db6abbc73e2d487\",\n        \"last4\": \"4242\",\n        \"livemode\": false,\n        \"metadata\": {},\n        \"name\": \"Joe Test User\",\n        \"object\": \"card\"\n      },\n      \"created\": 1487461244,\n      \"currency\": \"jpy\",\n      \"customer\": \"cus_7b74b10619d73859a093e5e60458\",\n      \"description\": null,\n      \"expired_at\": null,\n      \"failure_code\": null,\n      \"failure_message\": null,\n      \"id\": \"ch_fc9dd9a81a1002f651a5b5ae3e740\",\n      \"livemode\": false,\n      \"metadata\": null,\n      \"object\": \"charge\",\n      \"paid\": true,\n      \"refund_reason\": null,\n      \"refunded\": false,\n      \"subscription\": \"sub_d6b131aa1219b93e115b32dd7331\"\n    },\n    {\n      \"amount\": 100,\n      \"amount_refunded\": 0,\n      \"captured\": true,\n      \"captured_at\": 1487461243,\n      \"card\": {\n        \"address_city\": null,\n        \"address_line1\": null,\n        \"address_line2\": null,\n        \"address_state\": null,\n        \"address_zip\": null,\n        \"address_zip_check\": \"unchecked\",\n        \"brand\": \"Visa\",\n        \"country\": null,\n        \"created\": 1487461240,\n        \"customer\": null,\n        \"cvc_check\": \"passed\",\n        \"exp_month\": 1,\n        \"exp_year\": 2018,\n        \"fingerprint\": \"e1d8225886e3a7211127df751c86787f\",\n        \"id\": \"car_4e064abb0e027db6abbc73e2d487\",\n        \"last4\": \"4242\",\n        \"livemode\": false,\n        \"metadata\": {},\n        \"name\": \"Joe Test User\",\n        \"object\": \"card\"\n      },\n      \"created\": 1487461243,\n      \"currency\": \"jpy\",\n      \"customer\": \"cus_7b74b10619d73859a093e5e60458\",\n      \"description\": null,\n      \"expired_at\": null,\n      \"failure_code\": null,\n      \"failure_message\": null,\n      \"id\": \"ch_b453a3f7ae1cfa1c4a36484adc1e4\",\n      \"livemode\": false,\n      \"metadata\": null,\n      \"object\": \"charge\",\n      \"paid\": true,\n      \"refund_reason\": null,\n      \"refunded\": false,\n      \"subscription\": \"sub_9ea986d04f14f5c9f79c09a859de\"\n    },\n    {\n      \"amount\": 100,\n      \"amount_refunded\": 0,\n      \"captured\": true,\n      \"captured_at\": 1487461243,\n      \"card\": {\n        \"address_city\": null,\n        \"address_line1\": null,\n        \"address_line2\": null,\n        \"address_state\": null,\n        \"address_zip\": null,\n        \"address_zip_check\": \"unchecked\",\n        \"brand\": \"Visa\",\n        \"country\": null,\n        \"created\": 1487461240,\n        \"customer\": null,\n        \"cvc_check\": \"passed\",\n        \"exp_month\": 1,\n        \"exp_year\": 2018,\n        \"fingerprint\": \"e1d8225886e3a7211127df751c86787f\",\n        \"id\": \"car_4e064abb0e027db6abbc73e2d487\",\n        \"last4\": \"4242\",\n        \"livemode\": false,\n        \"metadata\": {},\n        \"name\": \"Joe Test User\",\n        \"object\": \"card\"\n      },\n      \"created\": 1487461243,\n      \"currency\": \"jpy\",\n      \"customer\": \"cus_7b74b10619d73859a093e5e60458\",\n      \"description\": null,\n      \"expired_at\": null,\n      \"failure_code\": null,\n      \"failure_message\": null,\n      \"id\": \"ch_c78e35a5e09fd870ecd730e1e6d41\",\n      \"livemode\": false,\n      \"metadata\": null,\n      \"object\": \"charge\",\n      \"paid\": true,\n      \"refund_reason\": null,\n      \"refunded\": false,\n      \"subscription\": \"sub_2cd160ac582adec1c80684855b96\"\n    },\n    {\n      \"amount\": 100,\n      \"amount_refunded\": 0,\n      \"captured\": true,\n      \"captured_at\": 1487461241,\n      \"card\": {\n        \"address_city\": null,\n        \"address_line1\": null,\n        \"address_line2\": null,\n        \"address_state\": null,\n        \"address_zip\": null,\n        \"address_zip_check\": \"unchecked\",\n        \"brand\": \"Visa\",\n        \"country\": null,\n        \"created\": 1487461240,\n        \"customer\": null,\n        \"cvc_check\": \"passed\",\n        \"exp_month\": 1,\n        \"exp_year\": 2018,\n        \"fingerprint\": \"e1d8225886e3a7211127df751c86787f\",\n        \"id\": \"car_4e064abb0e027db6abbc73e2d487\",\n        \"last4\": \"4242\",\n        \"livemode\": false,\n        \"metadata\": {},\n        \"name\": \"Joe Test User\",\n        \"object\": \"card\"\n      },\n      \"created\": 1487461242,\n      \"currency\": \"jpy\",\n      \"customer\": \"cus_7b74b10619d73859a093e5e60458\",\n      \"description\": null,\n      \"expired_at\": null,\n      \"failure_code\": null,\n      \"failure_message\": null,\n      \"id\": \"ch_a2caf465ddf14396d40ea49be9dda\",\n      \"livemode\": false,\n      \"metadata\": null,\n      \"object\": \"charge\",\n      \"paid\": true,\n      \"refund_reason\": null,\n      \"refunded\": false,\n      \"subscription\": \"sub_d01f40d1809b1a2b45bb8bc09367\"\n    },\n    {\n      \"amount\": 1000,\n      \"amount_refunded\": 0,\n      \"captured\": true,\n      \"captured_at\": 1487461241,\n      \"card\": {\n        \"address_city\": null,\n        \"address_line1\": null,\n        \"address_line2\": null,\n        \"address_state\": null,\n        \"address_zip\": null,\n        \"address_zip_check\": \"unchecked\",\n        \"brand\": \"Visa\",\n        \"country\": null,\n        \"created\": 1487461240,\n        \"customer\": null,\n        \"cvc_check\": \"passed\",\n        \"exp_month\": 1,\n        \"exp_year\": 2018,\n        \"fingerprint\": \"e1d8225886e3a7211127df751c86787f\",\n        \"id\": \"car_4e064abb0e027db6abbc73e2d487\",\n        \"last4\": \"4242\",\n        \"livemode\": false,\n        \"metadata\": {},\n        \"name\": \"Joe Test User\",\n        \"object\": \"card\"\n      },\n      \"created\": 1487461241,\n      \"currency\": \"jpy\",\n      \"customer\": \"cus_7b74b10619d73859a093e5e60458\",\n      \"description\": null,\n      \"expired_at\": null,\n      \"failure_code\": null,\n      \"failure_message\": null,\n      \"id\": \"ch_47fc73556f0341eb19b57abe76992\",\n      \"livemode\": false,\n      \"metadata\": null,\n      \"object\": \"charge\",\n      \"paid\": true,\n      \"refund_reason\": null,\n      \"refunded\": false,\n      \"subscription\": \"sub_c28668f4532136bfeec6a286d831\"\n    }\n  ],\n  \"has_more\": true,\n  \"object\": \"list\",\n  \"url\": \"/v1/charges\"\n}",
      "headers": {
        "Date": "Sun, 19 Feb 2017 04:28:45 GMT",
        "Content-Type": "application/json",
        "Content-Length": "12419",
        "Connection": "keep-alive",
        "Server": "nginx"
      },
      "status_code": 200,
      "type": "ok"
    }
  },
  {
    "request": {
      "body": "",
      "headers": {
        "Authorization": "Basic non_empty_secret_key_string",
        "Content-Type": "application/x-www-form-urlencoded",
        "User-Agent": "Payjp/v1 payjp/0.1.0"
      },
      "method": "get",
      "options": [],
      "request_body": "",
      "url": "https://api.pay.jp/v1/charges/ch_4359a2c004b2e74e51577a8e35440"
    },
    "response": {
      "body": "{\n  \"amount\": 1000,\n  \"amount_refunded\": 0,\n  \"captured\": true,\n  \"captured_at\": 1487478524,\n  \"card\": {\n    \"address_city\": null,\n    \"address_line1\": null,\n    \"address_line2\": null,\n    \"address_state\": null,\n    \"address_zip\": null,\n    \"address_zip_check\": \"unchecked\",\n    \"brand\": \"Visa\",\n    \"country\": null,\n    \"created\": 1487478522,\n    \"customer\": \"cus_b8bc48c00797c9b549155dfafa20\",\n    \"cvc_check\": \"passed\",\n    \"exp_month\": 1,\n    \"exp_year\": 2018,\n    \"fingerprint\": \"e1d8225886e3a7211127df751c86787f\",\n    \"id\": \"car_622cdc08de0c4c3a7aa38ef4456e\",\n    \"last4\": \"4242\",\n    \"livemode\": false,\n    \"metadata\": {},\n    \"name\": \"Joe Test User\",\n    \"object\": \"card\"\n  },\n  \"created\": 1487478524,\n  \"currency\": \"jpy\",\n  \"customer\": \"cus_b8bc48c00797c9b549155dfafa20\",\n  \"description\": null,\n  \"expired_at\": null,\n  \"failure_code\": null,\n  \"failure_message\": null,\n  \"id\": \"ch_4359a2c004b2e74e51577a8e35440\",\n  \"livemode\": false,\n  \"metadata\": {},\n  \"object\": \"charge\",\n  \"paid\": true,\n  \"refund_reason\": null,\n  \"refunded\": false,\n  \"subscription\": null\n}",
      "headers": {
        "Date": "Sun, 19 Feb 2017 04:28:45 GMT",
        "Content-Type": "application/json",
        "Content-Length": "1068",
        "Connection": "keep-alive",
        "Server": "nginx"
      },
      "status_code": 200,
      "type": "ok"
    }
  }
]